src/cf/src/InformationRegisters/ИсторияЗаказовПокупателейПоСтатусам/ИсторияЗаказовПокупателейПоСтатусам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗаказовПокупателейПоСтатусам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЗаказаПокупателя</name>
    <type>
      <types>EnumRef.СтатусыЗаказовПокупателя</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОбеспечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индикатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ПотребностиПроизводства/ПотребностиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностиПроизводства</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Заказано</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Пришло</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>ИзОстатка</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ВидыОперацийЗаказаПокупателя/ВидыОперацийЗаказаПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаказаПокупателя</name>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СтатусыЗаказовПокупателя/СтатусыЗаказовПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПокупателя</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПереданСубподрядчику</name>
  </enumValues>
  <enumValues>
    <name>ПолученОтСубподрядчика</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ФормируетсяПотребность</name>
  </enumValues>
  <enumValues>
    <name>ЗаказПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВосполнениеПотребности</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/CommonModules/ПроизводственныеЗаказы/Module.bsl
#Область ПрограммныйИнтерфейс

// Запоминает перед записью документа заказы клиента на производство, затронутые его прежним состоянием в базе, и
// режим записи. Вызывается в ПередЗаписью после проверок; без этой отметки остальные процедуры модуля ничего не
// делают. Режим загрузки и фоновое перепроведение последовательности стадии не пересчитывают.
//
// Параметры:
//  ДокОбъект   - ДокументОбъект - записываемый документ контура: заказ клиента, закупка, выпуск, реализация,
//                возврат от покупателя или денежный документ расчётов с покупателями.
//  РежимЗаписи - РежимЗаписиДокумента - режим записи из ПередЗаписью.
//
Процедура ЗапомнитьЗаказыДокумента(ДокОбъект, РежимЗаписи) Экспорт

	Если ПересчётНеВыполняется(ДокОбъект) Тогда
		Возврат;
	КонецЕсли;
	// Документ пишет пользователь роли, которая может не читать регистр потребностей или взаиморасчётов (PDV,
	// МенеджерПоПродажам): прежние заказы - служебное чтение движений самого документа.
	УстановитьПривилегированныйРежим(Истина);
	Данные = Новый Структура;
	Данные.Вставить("РежимЗаписи", РежимЗаписи);
	Данные.Вставить("ПрежниеЗаказы", ЗаказыДокумента(ДокОбъект, Ложь));
	ДокОбъект.ДополнительныеСвойства.Вставить(ИмяСвойства(), Данные);

КонецПроцедуры

// Пересчитывает стадии заказов документа после записи его движений. Вызывается последней строкой
// ОбработкаПроведения, после Движения.Записать(): блокировка истории статусов - последняя в транзакции.
//
// Параметры:
//  ДокОбъект - ДокументОбъект - проводимый документ (см. ЗапомнитьЗаказыДокумента).
//
Процедура ОбновитьСтадииПослеПроведения(ДокОбъект) Экспорт

	Данные = ДанныеДокумента(ДокОбъект, РежимЗаписиДокумента.Проведение);
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// Регистр истории статусов пишут роли без права на него (Казначей, Кладовщик, Логист, Оператор).
	УстановитьПривилегированныйРежим(Истина);
	ОбновитьСтадииЗаказов(ДокОбъект, Истина, Данные.ПрежниеЗаказы);

КонецПроцедуры

// Пересчитывает стадии при записи без проведения: заказ клиента (черновик, пометка удаления, запись проведённого
// заказа) и проведённый документ, перезаписанный без перепроведения. Непроведённые документы стадию не меняют.
//
// Параметры:
//  ДокОбъект - ДокументОбъект - записываемый документ (см. ЗапомнитьЗаказыДокумента).
//
Процедура ОбновитьСтадииПриЗаписи(ДокОбъект) Экспорт

	Данные = ДанныеДокумента(ДокОбъект, РежимЗаписиДокумента.Запись);
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ДокОбъект.Проведен И ТипЗнч(ДокОбъект) <> Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		Возврат;
	КонецЕсли;
	// Регистр истории статусов пишут роли без права на него; источники стадии читаются служебно.
	УстановитьПривилегированныйРежим(Истина);
	ОбновитьСтадииЗаказов(ДокОбъект, ДокОбъект.Проведен, Данные.ПрежниеЗаказы);

КонецПроцедуры

// Отмена проведения документа, затронувшего заказы на производство: блокировки в порядке проведения, явная очистка
// всех движений и пересчёт стадий. Очистка до пересчёта: иначе платформа удалила бы движения после записи истории,
// взяв неявные блокировки регистров позже блокировки истории. Без заказов на производство ничего не делает -
// движения удаляет платформа, как раньше. Работает только после ЗапомнитьЗаказыДокумента с режимом отмены
// проведения, поэтому движения произвольного документа не стирает.
//
// Параметры:
//  ДокОбъект  - ДокументОбъект - документ, у которого отменяется проведение.
//  Блокировка - БлокировкаДанных, Неопределено - блокировки проведения документа; Неопределено - без блокировок.
//
Процедура ОтменитьПроведениеДокумента(ДокОбъект, Блокировка) Экспорт

	Данные = ДанныеДокумента(ДокОбъект, РежимЗаписиДокумента.ОтменаПроведения);
	Если Данные = Неопределено Или Данные.ПрежниеЗаказы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	// Очистку движений и историю статусов выполняют роли без прав на эти регистры.
	УстановитьПривилегированныйРежим(Истина);
	Если Блокировка <> Неопределено Тогда
		Блокировка.Заблокировать();
	КонецЕсли;
	// Наборы очищаются явно: объект, проведённый в этом же экземпляре, ещё держит движения проведения, и запись
	// неочищенных наборов вернула бы их в базу.
	Для Каждого НаборЗаписей Из ДокОбъект.Движения Цикл
		НаборЗаписей.Очистить();
		НаборЗаписей.Записывать = Истина;
	КонецЦикла;
	ДокОбъект.Движения.Записать();
	ОбновитьСтадииЗаказов(ДокОбъект, Ложь, Данные.ПрежниеЗаказы);

КонецПроцедуры

// Рассчитывает стадию заказа клиента на производство, доли выполнения и индикатор по текущим данным. Ничего не
// пишет. Привилегированный режим не включает: пересчёт документа уже в нём.
//
// Параметры:
//  Заказ    - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//  Контекст - Структура, Неопределено - записываемый документ, чьи проведённость и пометка удаления берутся
//             отсюда, а не из базы:
//   * Документ        - ДокументСсылка - записываемый документ.
//   * Проведён        - Булево - учитывается ли документ.
//   * ПометкаУдаления - Булево - пометка удаления документа.
//
// Возвращаемое значение:
//  Неопределено - заказ не на производство или не найден;
//  Структура:
//   * Стадия          - ПеречислениеСсылка.СтатусыЗаказовПокупателя - стадия.
//   * ДоляОбеспечения - Число - заказано или пришло в пределах потребности материалов.
//   * ДоляПоступления - Число - пришло в пределах потребности.
//   * ДоляВыпуска     - Число - выпущено в пределах производимых строк.
//   * ДоляОтгрузки    - Число - отгружено за вычетом возвратов в пределах строк заказа.
//   * ДоляОплаты      - Число - оплачено от большей из сумм заказа и отгрузок.
//   * Индикатор       - Строка - пять символов ○◐● по долям.
//   * Долг            - Число - остаток расчётов по заказу и его реализациям.
//   * Оплачено        - Число - начислено реализациями минус долг, не меньше нуля.
//
Функция РассчитатьСтадию(Заказ, Контекст = Неопределено) Экспорт

	Данные = ДанныеРасчёта(Заказ, Контекст);
	Если Данные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Показатели = ПоказателиЗаказа(Данные);
	Результат = Новый Структура;
	Результат.Вставить("Стадия", СтадияПоПоказателям(Данные, Показатели));
	Результат.Вставить("ДоляОбеспечения", Доля(Показатели.Обеспечено, Показатели.Потребность));
	Результат.Вставить("ДоляПоступления", Доля(Показатели.Пришло, Показатели.Потребность));
	Результат.Вставить("ДоляВыпуска", Доля(Показатели.Выпущено, Показатели.КВыпуску));
	Результат.Вставить("ДоляОтгрузки", Доля(Показатели.Отгружено, Показатели.Заказано));
	ОплаченоПолностью = Показатели.ОтгруженоВсё И Данные.Долг <= 0;
	БазаОплаты = Макс(Данные.СуммаЗаказа, Данные.Начислено);
	ОплаченоВПределах = Мин(Данные.Оплачено, БазаОплаты);
	Если ОплаченоПолностью Тогда
		Результат.Вставить("ДоляОплаты", 1);
	Иначе
		// При долге или неполной отгрузке оплата не полная, даже если аванс покрыл сумму заказа.
		Результат.Вставить("ДоляОплаты", Мин(Доля(ОплаченоВПределах, БазаОплаты), МаксимумНеполнойДоли()));
	КонецЕсли;
	СимволыИндикатора = Новый Массив;
	СимволыИндикатора.Добавить(СимволДоли(Показатели.Обеспечено, Показатели.Потребность));
	СимволыИндикатора.Добавить(СимволДоли(Показатели.Пришло, Показатели.Потребность));
	СимволыИндикатора.Добавить(СимволДоли(Показатели.Выпущено, Показатели.КВыпуску));
	СимволыИндикатора.Добавить(СимволДоли(Показатели.Отгружено, Показатели.Заказано));
	Если ОплаченоПолностью Тогда
		СимволыИндикатора.Добавить(СимволПолностью());
	ИначеЕсли ОплаченоВПределах > 0 Тогда
		СимволыИндикатора.Добавить(СимволЧастично());
	Иначе
		СимволыИндикатора.Добавить(СимволНоль());
	КонецЕсли;
	Результат.Вставить("Индикатор", СтрСоединить(СимволыИндикатора));
	Результат.Вставить("Долг", Данные.Долг);
	Результат.Вставить("Оплачено", Данные.Оплачено);
	Возврат Результат;

КонецФункции

// Последняя запись истории заказа для формы и списка: стадия и индикатор. Читается под пользователем.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//
// Возвращаемое значение:
//  Неопределено - записи нет;
//  Структура:
//   * Стадия        - ПеречислениеСсылка.СтатусыЗаказовПокупателя - статус или стадия последней записи.
//   * Индикатор     - Строка - индикатор; пустой у записей продаж.
//   * ЭтоЗаписьСтадии - Булево - запись сделана расчётом стадий (заполнен индикатор).
//
Функция ДанныеСтадии(Заказ) Экспорт

	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	История.СтатусЗаказаПокупателя КАК Стадия,
	|	История.Индикатор КАК Индикатор
	|ИЗ
	|	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних(, ЗаказПокупателя = &Заказ) КАК История");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Результат = Новый Структура("Стадия, Индикатор", Выборка.Стадия, Выборка.Индикатор);
	Результат.Вставить("ЭтоЗаписьСтадии", ЗначениеЗаполнено(Выборка.Индикатор));
	Возврат Результат;

КонецФункции

// Подсказка к индикатору: что означает каждый кружок.
//
// Возвращаемое значение:
//  Строка - текст на языке пользователя.
//
Функция ЛегендаИндикатора() Экспорт

	Возврат НСтр("ru = 'Кружки: обеспечение материалами, поступление материалов, выпуск, отгрузка, оплата.
		|○ - не начато, ◐ - частично, ● - полностью.';
		|fr = 'Cercles : approvisionnement en matières, réception des matières, production, expédition, paiement.
		|○ - non commencé, ◐ - partiel, ● - complet.';
		|en = 'Circles: materials ordered, materials received, production, shipment, payment.
		|○ - not started, ◐ - partial, ● - complete.';
		|es = 'Círculos: abastecimiento de materiales, recepción de materiales, producción, envío, pago.
		|○ - sin empezar, ◐ - parcial, ● - completo.'");

КонецФункции

// Заказ клиента - заказ на производство (по виду операции в базе).
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя, Неопределено - заказ клиента.
//
// Возвращаемое значение:
//  Булево - Истина, если вид операции заказа «Производство».
//
Функция ЭтоЗаказНаПроизводство(Заказ) Экспорт

	Если ТипЗнч(Заказ) <> Тип("ДокументСсылка.ЗаказПокупателя") Или Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;
	ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "ВидОперации");
	Возврат ВидОперации = Перечисления.ВидыОперацийЗаказаПокупателя.Производство;

КонецФункции

// Выполнение заказа на производство по продукции - строки расчета стадии (E8) без потребностей и взаиморасчетов: заказано, к
// выпуску, выпущено ручными выпусками и автовыпусками реализаций заказа, отгружено проведенными документами. Для
// рабочего места производства и заполнения выпуска по заказу (E12.3).
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Номенклатура, Характеристика, Единица, Заказано, КВыпуску, Выпущено, Отгружено; у заказа не на
//                    производство - пустая.
//
Функция ВыполнениеПоПродукции(Заказ) Экспорт

	Запрос = Новый Запрос(ТекстЗапросаОтгрузок() + ТекстЗапросаСтрокВыполнения());
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Документ", Неопределено);
	// BSLLS:YoLetterUsage-off - имя параметра общего текста запроса расчета стадии.
	Запрос.УстановитьПараметр("ДокументПроведён", Ложь);
	// BSLLS:YoLetterUsage-on
	Результаты = Запрос.ВыполнитьПакет();
	Строки = Результаты[ИндексСтрокЗаказа()].Выгрузить();
	Шапка = Результаты[0].Выбрать();
	Если Не Шапка.Следующий() Или Шапка.ВидОперации <> Перечисления.ВидыОперацийЗаказаПокупателя.Производство Тогда
		Строки.Очистить();
	КонецЕсли;
	Возврат Строки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСвойства()

	Возврат "ПроизводственныеЗаказыДокумента";

КонецФункции

// Режим загрузки, фоновое перепроведение последовательности и вложенная запись автовыпуска (E9: стадии пересчитывает
// реализация последней строкой проведения, движения автовыпуска при отмене удаляет платформа под её блокировками).
//
// Параметры:
//  ДокОбъект - ДокументОбъект - записываемый документ контура.
//
// Возвращаемое значение:
//  Булево - Истина, если стадии не пересчитываются.
//
Функция ПересчётНеВыполняется(ДокОбъект)

	Возврат ДокОбъект.ОбменДанными.Загрузка
		Или ДокОбъект.ДополнительныеСвойства.Свойство(РаботаСДокументами.СвойствоВыполняетсяФоновоеПерепроведение())
		Или Производство.ЭтоЗаписьАвтовыпуска(ДокОбъект);

КонецФункции

Функция ДанныеДокумента(ДокОбъект, РежимЗаписи)

	Если ПересчётНеВыполняется(ДокОбъект) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Данные = Неопределено;
	Если Не ДокОбъект.ДополнительныеСвойства.Свойство(ИмяСвойства(), Данные) Или ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Данные.РежимЗаписи <> РежимЗаписи Тогда
		Возврат Неопределено;
	КонецЕсли;
	// Отметка одноразовая: прямое удаление проведённого документа после записи не должно найти прежнюю.
	ДокОбъект.ДополнительныеСвойства.Удалить(ИмяСвойства());
	Возврат Данные;

КонецФункции

Процедура ОбновитьСтадииЗаказов(ДокОбъект, Проведён, ПрежниеЗаказы)

	Заказы = Новый Массив;
	ДобавитьЗаказы(Заказы, ПрежниеЗаказы);
	ДобавитьЗаказы(Заказы, ЗаказыДокумента(ДокОбъект, Истина));
	Если Заказы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ЗаблокироватьИсторию(Заказы);
	Контекст = Новый Структура;
	Контекст.Вставить("Документ", ДокОбъект.Ссылка);
	Контекст.Вставить("Проведён", Проведён);
	Контекст.Вставить("ПометкаУдаления", ДокОбъект.ПометкаУдаления);
	Для Каждого Заказ Из Заказы Цикл
		ЗаписатьСтадию(Заказ, Контекст);
	КонецЦикла;

КонецПроцедуры

// Заказы на производство документа. Прежнее состояние - из базы до записи, текущее - после записи: реквизиты
// объекта и движения, уже записанные в базу. Читаются только регистры, которые пишет сам документ.
//
// Параметры:
//  ДокОбъект   - ДокументОбъект - документ контура.
//  ПослеЗаписи - Булево - Истина: реквизиты объекта; Ложь: реквизиты из базы до записи.
//
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗаказПокупателя - заказы клиента с видом операции «Производство» в базе.
//
Функция ЗаказыДокумента(ДокОбъект, ПослеЗаписи)

	Заказы = Новый Массив;
	Ссылка = ДокОбъект.Ссылка;
	// У нового документа прежнего состояния нет, даже если ссылка нового уже назначена.
	Если Не ЗначениеЗаполнено(Ссылка) Или Не ПослеЗаписи И ДокОбъект.ЭтоНовый() Тогда
		Возврат Заказы;
	КонецЕсли;
	ТипДокумента = ТипЗнч(ДокОбъект);
	Если ТипДокумента = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		Заказы.Добавить(Ссылка);
	ИначеЕсли ЭтоДокументЗакупки(ТипДокумента) Тогда
		ДобавитьЗаказы(Заказы, РегистрыНакопления.ПотребностиПроизводства.ЗаказыДвиженийДокумента(Ссылка));
	Иначе
		ДобавитьЗаказ(Заказы, ЗаказОснованияДокумента(ДокОбъект, ПослеЗаписи));
		Если ПишетВзаиморасчётыСПокупателями(ТипДокумента) Тогда
			ДобавитьЗаказы(Заказы, ЗаказыДвиженийВзаиморасчётов(Ссылка));
		КонецЕсли;
	КонецЕсли;
	Возврат ЗаказыНаПроизводство(Заказы);

КонецФункции

// Заказ клиента по основанию выпуска, реализации или возврата от покупателя (через реализацию-основание). Автовыпуск
// при отгрузке (основание - реализация) - заказ реализации (E9).
//
// Параметры:
//  ДокОбъект   - ДокументОбъект - документ контура.
//  ПослеЗаписи - Булево - Истина: основание объекта; Ложь: основание из базы до записи.
//
// Возвращаемое значение:
//  ДокументСсылка.ЗаказПокупателя, Неопределено - заказ основания.
//
Функция ЗаказОснованияДокумента(ДокОбъект, ПослеЗаписи)

	ТипДокумента = ТипЗнч(ДокОбъект);
	Если ТипДокумента = Тип("ДокументОбъект.ВыпускПродукции") Тогда
		Заказ = ОснованиеДокумента(ДокОбъект, ПослеЗаписи);
		Если ТипЗнч(Заказ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Заказ = Производство.ЗаказРеализацииОснования(Заказ);
		КонецЕсли;
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Заказ = ОснованиеДокумента(ДокОбъект, ПослеЗаписи);
	ИначеЕсли ТипДокумента = Тип("ДокументОбъект.ВозвратОтПокупателя") Тогда
		Реализация = ОснованиеДокумента(ДокОбъект, ПослеЗаписи);
		Заказ = Неопределено;
		Если ТипЗнч(Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И ЗначениеЗаполнено(Реализация) Тогда
			Заказ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реализация, "Основание");
		КонецЕсли;
	Иначе
		Заказ = Неопределено;
	КонецЕсли;
	Возврат Заказ;

КонецФункции

Функция ОснованиеДокумента(ДокОбъект, ИзОбъекта)

	Если ИзОбъекта Тогда
		Возврат ДокОбъект.Основание;
	КонецЕсли;
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.Ссылка, "Основание");

КонецФункции

Функция ЭтоДокументЗакупки(ТипДокумента)

	Возврат ТипДокумента = Тип("ДокументОбъект.ЗаказПоставщику")
		Или ТипДокумента = Тип("ДокументОбъект.ПоступлениеТоваровУслуг")
		Или ТипДокумента = Тип("ДокументОбъект.ВозвратПоставщику");

КонецФункции

Функция ПишетВзаиморасчётыСПокупателями(ТипДокумента)

	Возврат ТипДокумента = Тип("ДокументОбъект.РеализацияТоваровУслуг")
		Или ТипДокумента = Тип("ДокументОбъект.ВозвратОтПокупателя")
		Или ТипДокумента = Тип("ДокументОбъект.ПриходныйКассовыйОрдер")
		Или ТипДокумента = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств")
		Или ТипДокумента = Тип("ДокументОбъект.РасходныйКассовыйОрдер")
		Или ТипДокумента = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств")
		Или ТипДокумента = Тип("ДокументОбъект.КорректировкаДолга")
		Или ТипДокумента = Тип("ДокументОбъект.СертификатНаОплату");

КонецФункции

// Заказы клиента из движений взаиморасчётов документа: объект расчётов - заказ или реализация (её основание).
// Отбор по регистратору - индекс таблицы движений.
//
// Параметры:
//  Регистратор - ДокументСсылка - документ, пишущий взаиморасчёты с покупателями.
//
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЗаказПокупателя - заказы без повторов.
//
Функция ЗаказыДвиженийВзаиморасчётов(Регистратор)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Движения.ОбъектРасчётов ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Движения.ОбъектРасчётов КАК Документ.РеализацияТоваровУслуг).Основание
	|		ИНАЧЕ Движения.ОбъектРасчётов
	|	КОНЕЦ КАК Заказ
	|ИЗ
	|	РегистрНакопления.ВзаиморасчётыСПокупателями КАК Движения
	|ГДЕ
	|	Движения.Регистратор = &Регистратор
	|	И (Движения.ОбъектРасчётов ССЫЛКА Документ.ЗаказПокупателя
	|		ИЛИ Движения.ОбъектРасчётов ССЫЛКА Документ.РеализацияТоваровУслуг)");
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Заказы = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьЗаказ(Заказы, Выборка.Заказ);
	КонецЦикла;
	Возврат Заказы;

КонецФункции

Функция ЗаказыНаПроизводство(Заказы)

	Если Заказы.Количество() = 0 Тогда
		Возврат Заказы;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Заказы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Заказы
	|ГДЕ
	|	Заказы.Ссылка В (&Заказы)
	|	И Заказы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказаПокупателя.Производство)");
	Запрос.УстановитьПараметр("Заказы", Заказы);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Процедура ДобавитьЗаказы(Заказы, Добавляемые)

	Для Каждого Заказ Из Добавляемые Цикл
		ДобавитьЗаказ(Заказы, Заказ);
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьЗаказ(Заказы, Заказ)

	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(Заказ)
		И Заказы.Найти(Заказ) = Неопределено Тогда
		Заказы.Добавить(Заказ);
	КонецЕсли;

КонецПроцедуры

// Исключительная блокировка истории статусов по заказам в порядке уникальных идентификаторов: два документа с
// общими заказами берут блокировки в одном порядке.
//
// Параметры:
//  Заказы - Массив из ДокументСсылка.ЗаказПокупателя - блокируемые заказы.
//
Процедура ЗаблокироватьИсторию(Заказы)

	Порядок = Новый СписокЗначений;
	Для Каждого Заказ Из Заказы Цикл
		Порядок.Добавить(Заказ, Строка(Заказ.УникальныйИдентификатор()));
	КонецЦикла;
	Порядок.СортироватьПоПредставлению();
	Блокировка = Новый БлокировкаДанных;
	Для Каждого ЭлементПорядка Из Порядок Цикл
		УправляемыеБлокировки.ИсторияСтатусовЗаказа(Блокировка, ЭлементПорядка.Значение);
	КонецЦикла;
	Блокировка.Заблокировать();

КонецПроцедуры

Процедура ЗаписатьСтадию(Заказ, Контекст)

	Расчёт = РассчитатьСтадию(Заказ, Контекст);
	Если Расчёт = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	История.СтатусЗаказаПокупателя КАК Стадия,
	|	История.ДоляОбеспечения КАК ДоляОбеспечения,
	|	История.ДоляПоступления КАК ДоляПоступления,
	|	История.ДоляВыпуска КАК ДоляВыпуска,
	|	История.ДоляОтгрузки КАК ДоляОтгрузки,
	|	История.ДоляОплаты КАК ДоляОплаты,
	|	История.Индикатор КАК Индикатор
	|ИЗ
	|	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних(, ЗаказПокупателя = &Заказ) КАК История");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗаписьСовпадает(Выборка, Расчёт) Тогда
		Возврат;
	КонецЕсли;
	Запись = РегистрыСведений.ИсторияЗаказовПокупателейПоСтатусам.СоздатьМенеджерЗаписи();
	Запись.Период = РаботаСДокументами.ПериодЗаписиСтатусаЗаказа(Заказ);
	Запись.ЗаказПокупателя = Заказ;
	Запись.СтатусЗаказаПокупателя = Расчёт.Стадия;
	Запись.ДоляОбеспечения = Расчёт.ДоляОбеспечения;
	Запись.ДоляПоступления = Расчёт.ДоляПоступления;
	Запись.ДоляВыпуска = Расчёт.ДоляВыпуска;
	Запись.ДоляОтгрузки = Расчёт.ДоляОтгрузки;
	Запись.ДоляОплаты = Расчёт.ДоляОплаты;
	Запись.Индикатор = Расчёт.Индикатор;
	Запись.Записать(Ложь);

КонецПроцедуры

Функция ЗаписьСовпадает(Выборка, Расчёт)

	Возврат Выборка.Стадия = Расчёт.Стадия
		И Выборка.ДоляОбеспечения = Расчёт.ДоляОбеспечения
		И Выборка.ДоляПоступления = Расчёт.ДоляПоступления
		И Выборка.ДоляВыпуска = Расчёт.ДоляВыпуска
		И Выборка.ДоляОтгрузки = Расчёт.ДоляОтгрузки
		И Выборка.ДоляОплаты = Расчёт.ДоляОплаты
		И Выборка.Индикатор = Расчёт.Индикатор;

КонецФункции

// Данные расчёта одним пакетом: шапка заказа, строки товаров с выпуском и отгрузкой, потребности материалов,
// начисления реализаций и долг. Проведённость записываемого документа - из контекста.
//
// Параметры:
//  Заказ    - ДокументСсылка.ЗаказПокупателя - заказ клиента.
//  Контекст - Структура, Неопределено - см. РассчитатьСтадию.
//
// Возвращаемое значение:
//  Неопределено - заказ не на производство или не найден;
//  Структура - Проведён, ПометкаУдаления, СуммаЗаказа, Строки, Потребности (ТаблицаЗначений), Начислено, Долг, Оплачено.
//
Функция ДанныеРасчёта(Заказ, Контекст)

	Запрос = Новый Запрос(ТекстЗапросаРасчёта());
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Документ = Неопределено;
	ДокументПроведён = Ложь;
	Если Контекст <> Неопределено Тогда
		Документ = Контекст.Документ;
		ДокументПроведён = Контекст.Проведён;
	КонецЕсли;
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ДокументПроведён", ДокументПроведён);
	Результаты = Запрос.ВыполнитьПакет();

	Шапка = Результаты[0].Выбрать();
	Если Не Шапка.Следующий()
		Или Шапка.ВидОперации <> Перечисления.ВидыОперацийЗаказаПокупателя.Производство Тогда
		Возврат Неопределено;
	КонецЕсли;
	Данные = Новый Структура;
	Если Контекст <> Неопределено И Контекст.Документ = Заказ Тогда
		Данные.Вставить("Проведён", Контекст.Проведён);
		Данные.Вставить("ПометкаУдаления", Контекст.ПометкаУдаления);
	Иначе
		Данные.Вставить("Проведён", Шапка.Проведен);
		Данные.Вставить("ПометкаУдаления", Шапка.ПометкаУдаления);
	КонецЕсли;
	Данные.Вставить("СуммаЗаказа", Шапка.Сумма);
	Данные.Вставить("Строки", Результаты[ИндексСтрокЗаказа()].Выгрузить());
	Данные.Вставить("Потребности", Результаты[ИндексПотребностей()].Выгрузить());
	Итоги = Результаты[ИндексИтоговРасчётов()].Выбрать();
	Итоги.Следующий();
	Данные.Вставить("Начислено", ЧислоИлиНоль(Итоги.Начислено));
	Данные.Вставить("Долг", ЧислоИлиНоль(Итоги.Долг));
	Данные.Вставить("Оплачено", Макс(0, Данные.Начислено - Данные.Долг));
	Возврат Данные;

КонецФункции

Функция ИндексСтрокЗаказа()

	// BSLLS:MagicNumber-off - номер запроса пакета ТекстЗапросаРасчёта.
	Возврат 7;
	// BSLLS:MagicNumber-on

КонецФункции

Функция ИндексПотребностей()

	// BSLLS:MagicNumber-off - номер запроса пакета ТекстЗапросаРасчёта.
	Возврат 8;
	// BSLLS:MagicNumber-on

КонецФункции

Функция ИндексИтоговРасчётов()

	// BSLLS:MagicNumber-off - номер запроса пакета ТекстЗапросаРасчёта.
	Возврат 9;
	// BSLLS:MagicNumber-on

КонецФункции

Функция ТекстЗапросаРасчёта()

	// 0 - шапка; 1 - реализации заказа (все: долг по помеченной реализации не выпадает); 2 - возвраты по ним;
	// 3 - производимые строки; 4 - выпущено, в том числе автовыпусками реализаций заказа (E9); 5 - отгружено; 6 - строки
	// заказа; 7 - строки с выпуском и отгрузкой; 8 - потребности («пришло» вместе с «ИзОстатка», E9); 9 - начислено и долг.
	Возврат ТекстЗапросаОтгрузок() + ТекстЗапросаИтогов();

КонецФункции

Функция ТекстЗапросаОтгрузок()

	Возврат
	"ВЫБРАТЬ
	|	Заказы.Проведен КАК Проведен,
	|	Заказы.ПометкаУдаления КАК ПометкаУдаления,
	|	Заказы.ВидОперации КАК ВидОперации,
	|	Заказы.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Заказы
	|ГДЕ
	|	Заказы.Ссылка = &Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реализации.Ссылка КАК Ссылка,
	|	Реализации.Контрагент КАК Контрагент,
	|	Реализации.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Реализации.Ссылка = &Документ
	|			ТОГДА &ДокументПроведён
	|		ИНАЧЕ Реализации.Проведен
	|	КОНЕЦ КАК Учитывается
	|ПОМЕСТИТЬ ВТРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реализации
	|ГДЕ
	|	Реализации.Основание = &Заказ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Возвраты.Ссылка КАК Ссылка,
	|	Возвраты.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Возвраты.Ссылка = &Документ
	|			ТОГДА &ДокументПроведён
	|		ИНАЧЕ Возвраты.Проведен
	|	КОНЕЦ КАК Учитывается
	|ПОМЕСТИТЬ ВТВозвраты
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК Возвраты
	|ГДЕ
	|	Возвраты.Основание В
	|			(ВЫБРАТЬ
	|				ВТРеализации.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТРеализации КАК ВТРеализации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Материалы.КодСтрокиПродукции КАК КодСтроки
	|ПОМЕСТИТЬ ВТПроизводимые
	|ИЗ
	|	Документ.ЗаказПокупателя.ТЧМатериалы КАК Материалы
	|ГДЕ
	|	Материалы.Ссылка = &Заказ
	|	И Материалы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеВыпуски.Номенклатура КАК Номенклатура,
	|	ВсеВыпуски.Характеристика КАК Характеристика,
	|	СУММА(ВсеВыпуски.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТВыпущено
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГотоваяПродукция.Номенклатура КАК Номенклатура,
	|		ГотоваяПродукция.Характеристика КАК Характеристика,
	|		ГотоваяПродукция.Количество КАК Количество
	|	ИЗ
	|		Документ.ВыпускПродукции КАК Выпуски
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.ТЧГотоваяПродукция КАК ГотоваяПродукция
	|			ПО Выпуски.Ссылка = ГотоваяПродукция.Ссылка
	|	ГДЕ
	|		Выпуски.Основание = &Заказ
	|		И ВЫБОР
	|				КОГДА Выпуски.Ссылка = &Документ
	|					ТОГДА &ДокументПроведён
	|				ИНАЧЕ Выпуски.Проведен
	|			КОНЕЦ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ГотоваяПродукция.Номенклатура,
	|		ГотоваяПродукция.Характеристика,
	|		ГотоваяПродукция.Количество
	|	ИЗ
	|		Документ.ВыпускПродукции КАК Выпуски
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.ТЧГотоваяПродукция КАК ГотоваяПродукция
	|			ПО Выпуски.Ссылка = ГотоваяПродукция.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРеализации КАК ВТРеализации
	|			ПО Выпуски.Основание = ВТРеализации.Ссылка
	|	ГДЕ
	|		ВЫБОР
	|			КОГДА Выпуски.Ссылка = &Документ
	|				ТОГДА &ДокументПроведён
	|			ИНАЧЕ Выпуски.Проведен
	|		КОНЕЦ) КАК ВсеВыпуски
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеВыпуски.Номенклатура,
	|	ВсеВыпуски.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Отгрузки.Номенклатура КАК Номенклатура,
	|	Отгрузки.Характеристика КАК Характеристика,
	|	СУММА(Отгрузки.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТОтгружено
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыРеализаций.Номенклатура КАК Номенклатура,
	|		ТоварыРеализаций.Характеристика КАК Характеристика,
	|		ТоварыРеализаций.Количество КАК Количество
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.ТЧТовары КАК ТоварыРеализаций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРеализации КАК ВТРеализации
	|			ПО ТоварыРеализаций.Ссылка = ВТРеализации.Ссылка
	|	ГДЕ
	|		ВТРеализации.Учитывается
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТоварыВозвратов.Номенклатура,
	|		ТоварыВозвратов.Характеристика,
	|		-ТоварыВозвратов.Количество
	|	ИЗ
	|		Документ.ВозвратОтПокупателя.ТЧТовары КАК ТоварыВозвратов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВозвраты КАК ВТВозвраты
	|			ПО ТоварыВозвратов.Ссылка = ВТВозвраты.Ссылка
	|	ГДЕ
	|		ВТВозвраты.Учитывается) КАК Отгрузки
	|
	|СГРУППИРОВАТЬ ПО
	|	Отгрузки.Номенклатура,
	|	Отгрузки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";

КонецФункции

Функция ТекстЗапросаИтогов()

	Возврат ТекстЗапросаСтрокВыполнения() + ТекстЗапросаПотребностейИРасчетов();

КонецФункции

// Возвращаемое значение:
//  Строка - запросы 6 и 7 пакета расчета стадии: строки заказа, строки с выпуском и отгрузкой.
//
Функция ТекстЗапросаСтрокВыполнения()

	Возврат
	"ВЫБРАТЬ
	|	ТоварыЗаказа.Номенклатура КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика КАК Характеристика,
	|	СУММА(ТоварыЗаказа.Количество) КАК Заказано,
	|	СУММА(ВЫБОР
	|			КОГДА ВТПроизводимые.КодСтроки ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ ТоварыЗаказа.Количество
	|		КОНЕЦ) КАК КВыпуску
	|ПОМЕСТИТЬ ВТСтроки
	|ИЗ
	|	Документ.ЗаказПокупателя.ТЧТовары КАК ТоварыЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПроизводимые КАК ВТПроизводимые
	|		ПО ТоварыЗаказа.КодСтроки = ВТПроизводимые.КодСтроки
	|ГДЕ
	|	ТоварыЗаказа.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтроки.Номенклатура КАК Номенклатура,
	|	ВТСтроки.Характеристика КАК Характеристика,
	|	ВТСтроки.Заказано КАК Заказано,
	|	ВТСтроки.КВыпуску КАК КВыпуску,
	|	НоменклатураСтрок.Единица КАК Единица,
	|	ЕСТЬNULL(ВТВыпущено.Количество, 0) КАК Выпущено,
	|	ЕСТЬNULL(ВТОтгружено.Количество, 0) КАК Отгружено
	|ИЗ
	|	ВТСтроки КАК ВТСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСтрок
	|		ПО НоменклатураСтрок.Ссылка = ВТСтроки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыпущено КАК ВТВыпущено
	|		ПО ВТСтроки.Номенклатура = ВТВыпущено.Номенклатура
	|			И ВТСтроки.Характеристика = ВТВыпущено.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтгружено КАК ВТОтгружено
	|		ПО ВТСтроки.Номенклатура = ВТОтгружено.Номенклатура
	|			И ВТСтроки.Характеристика = ВТОтгружено.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";

КонецФункции

// Возвращаемое значение:
//  Строка - запросы 8 и 9 пакета расчета стадии: потребности и начисления с долгом.
//
Функция ТекстЗапросаПотребностейИРасчетов()

	Возврат
	"ВЫБРАТЬ
	|	ДвиженияПотребностей.Материал КАК Материал,
	|	ДвиженияПотребностей.Характеристика КАК Характеристика,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияПотребностей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ДвиженияПотребностей.Потребность
	|			ИНАЧЕ -ДвиженияПотребностей.Потребность
	|		КОНЕЦ) КАК Потребность,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияПотребностей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ДвиженияПотребностей.Заказано
	|			ИНАЧЕ -ДвиженияПотребностей.Заказано
	|		КОНЕЦ) КАК Заказано,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияПотребностей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ДвиженияПотребностей.Пришло + ДвиженияПотребностей.ИзОстатка
	|			ИНАЧЕ -ДвиженияПотребностей.Пришло - ДвиженияПотребностей.ИзОстатка
	|		КОНЕЦ) КАК Пришло
	|ИЗ
	|	РегистрНакопления.ПотребностиПроизводства КАК ДвиженияПотребностей
	|ГДЕ
	|	ДвиженияПотребностей.Заказ = &Заказ
	|	И ДвиженияПотребностей.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияПотребностей.Материал,
	|	ДвиженияПотребностей.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Начисления.Начислено, 0) КАК Начислено,
	|	ЕСТЬNULL(ДолгиРасчётов.Долг, 0) КАК Долг
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(Суммы.Сумма) КАК Начислено
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВТРеализации.Сумма КАК Сумма
	|		ИЗ
	|			ВТРеализации КАК ВТРеализации
	|		ГДЕ
	|			ВТРеализации.Учитывается
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			-ВТВозвраты.Сумма
	|		ИЗ
	|			ВТВозвраты КАК ВТВозвраты
	|		ГДЕ
	|			ВТВозвраты.Учитывается) КАК Суммы) КАК Начисления,
	|	(ВЫБРАТЬ
	|		СУММА(ОстаткиРасчётов.СуммаОстаток) КАК Долг
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(
	|				,
	|				Контрагент В
	|						(ВЫБРАТЬ
	|							Заказы.Контрагент КАК Контрагент
	|						ИЗ
	|							Документ.ЗаказПокупателя КАК Заказы
	|						ГДЕ
	|							Заказы.Ссылка = &Заказ
	|
	|						ОБЪЕДИНИТЬ ВСЕ
	|
	|						ВЫБРАТЬ
	|							ВТРеализации.Контрагент
	|						ИЗ
	|							ВТРеализации КАК ВТРеализации)
	|					И (ОбъектРасчётов = &Заказ
	|						ИЛИ ОбъектРасчётов В
	|							(ВЫБРАТЬ
	|								ВТРеализации.Ссылка КАК Ссылка
	|							ИЗ
	|								ВТРеализации КАК ВТРеализации))) КАК ОстаткиРасчётов) КАК ДолгиРасчётов";

КонецФункции

// Суммарные показатели заказа по данным расчёта: количества в пределах заказанного и признаки полноты.
//
// Параметры:
//  Данные - Структура - см. ДанныеРасчёта.
//
// Возвращаемое значение:
//  Структура - Заказано, Отгружено, ОтгруженоВсё, КВыпуску, Выпущено, ВыпущеноВсё, Потребность, Обеспечено, Пришло,
//              ОбеспеченоВсё, ПришлоВсё.
//
Функция ПоказателиЗаказа(Данные)

	Показатели = Новый Структура;
	ДобавитьПоказателиСтрок(Показатели, Данные.Строки);
	ДобавитьПоказателиПотребностей(Показатели, Данные.Потребности);
	Возврат Показатели;

КонецФункции

Процедура ДобавитьПоказателиСтрок(Показатели, Строки)

	Показатели.Вставить("Заказано", 0);
	Показатели.Вставить("Отгружено", 0);
	Показатели.Вставить("ОтгруженоВсё", Строки.Количество() > 0);
	Показатели.Вставить("КВыпуску", 0);
	Показатели.Вставить("Выпущено", 0);
	ЕстьПроизводимые = Ложь;
	ВыпущеноВсё = Истина;
	Для Каждого СтрокаЗаказа Из Строки Цикл
		Показатели.Заказано = Показатели.Заказано + СтрокаЗаказа.Заказано;
		Показатели.Отгружено = Показатели.Отгружено + Мин(Макс(СтрокаЗаказа.Отгружено, 0), СтрокаЗаказа.Заказано);
		Показатели.ОтгруженоВсё = Показатели.ОтгруженоВсё И СтрокаЗаказа.Отгружено >= СтрокаЗаказа.Заказано;
		Если СтрокаЗаказа.КВыпуску <= 0 Тогда
			Продолжить;
		КонецЕсли;
		ЕстьПроизводимые = Истина;
		Показатели.КВыпуску = Показатели.КВыпуску + СтрокаЗаказа.КВыпуску;
		Показатели.Выпущено = Показатели.Выпущено + Мин(Макс(СтрокаЗаказа.Выпущено, 0), СтрокаЗаказа.КВыпуску);
		ВыпущеноВсё = ВыпущеноВсё И СтрокаЗаказа.Выпущено >= СтрокаЗаказа.КВыпуску;
	КонецЦикла;
	Показатели.Вставить("ВыпущеноВсё", ЕстьПроизводимые И ВыпущеноВсё);

КонецПроцедуры

Процедура ДобавитьПоказателиПотребностей(Показатели, Потребности)

	Показатели.Вставить("Потребность", 0);
	Показатели.Вставить("Обеспечено", 0);
	Показатели.Вставить("Пришло", 0);
	Показатели.Вставить("ОбеспеченоВсё", Истина);
	Показатели.Вставить("ПришлоВсё", Истина);
	Для Каждого СтрокаПотребности Из Потребности Цикл
		Если СтрокаПотребности.Потребность <= 0 Тогда
			Продолжить;
		КонецЕсли;
		// Пришедшее без заказа поставщику считается и заказанным: закупка поступлением не держит стадию.
		Обеспечено = Макс(СтрокаПотребности.Заказано, СтрокаПотребности.Пришло);
		Потребность = СтрокаПотребности.Потребность;
		Показатели.Потребность = Показатели.Потребность + Потребность;
		Показатели.Обеспечено = Показатели.Обеспечено + Мин(Макс(Обеспечено, 0), Потребность);
		Показатели.Пришло = Показатели.Пришло + Мин(Макс(СтрокаПотребности.Пришло, 0), Потребность);
		Показатели.ОбеспеченоВсё = Показатели.ОбеспеченоВсё И Обеспечено >= Потребность;
		Показатели.ПришлоВсё = Показатели.ПришлоВсё И СтрокаПотребности.Пришло >= Потребность;
	КонецЦикла;

КонецПроцедуры

// Каскад стадий (план E8, решение владельца 6: поздняя веха закрывает ранние).
//
// Параметры:
//  Данные     - Структура - см. ДанныеРасчёта.
//  Показатели - Структура - см. ПоказателиЗаказа.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыЗаказовПокупателя - стадия.
//
Функция СтадияПоПоказателям(Данные, Показатели)

	Стадии = Перечисления.СтатусыЗаказовПокупателя;
	Если Не Данные.Проведён Или Данные.ПометкаУдаления Тогда
		Стадия = Стадии.Черновик;
	ИначеЕсли Показатели.ОтгруженоВсё Тогда
		Стадия = ?(Данные.Долг > 0, Стадии.ОжидаетОплаты, Стадии.Выполнен);
	ИначеЕсли Показатели.ВыпущеноВсё Тогда
		Стадия = Стадии.ОжидаетОтгрузки;
	ИначеЕсли Показатели.Потребность <= 0 Тогда
		Стадия = Стадии.ФормируетсяПотребность;
	ИначеЕсли Не Показатели.ОбеспеченоВсё Тогда
		Стадия = Стадии.ЗаказПоставщику;
	ИначеЕсли Не Показатели.ПришлоВсё Тогда
		Стадия = Стадии.ВосполнениеПотребности;
	Иначе
		Стадия = Стадии.ВПроизводстве;
	КонецЕсли;
	Возврат Стадия;

КонецФункции

// Хранимая доля 0..1 с четырьмя знаками: неполная не округляется до единицы, ненулевая - до нуля.
//
// Параметры:
//  Числитель   - Число - выполнено в пределах знаменателя.
//  Знаменатель - Число - база доли.
//
// Возвращаемое значение:
//  Число - доля с четырьмя знаками.
//
Функция Доля(Числитель, Знаменатель)

	Если Знаменатель <= 0 Или Числитель <= 0 Тогда
		Результат = 0;
	ИначеЕсли Числитель >= Знаменатель Тогда
		Результат = 1;
	Иначе
		// BSLLS:MagicNumber-off - точность реквизитов долей регистра истории.
		Результат = Макс(Мин(Окр(Числитель / Знаменатель, 4), МаксимумНеполнойДоли()), 0.0001);
		// BSLLS:MagicNumber-on
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция МаксимумНеполнойДоли()

	// BSLLS:MagicNumber-off - наибольшая доля с четырьмя знаками меньше единицы.
	Возврат 0.9999;
	// BSLLS:MagicNumber-on

КонецФункции

// Символ индикатора по точным значениям, а не по округлённой доле.
//
// Параметры:
//  Числитель   - Число - выполнено в пределах знаменателя.
//  Знаменатель - Число - база доли.
//
// Возвращаемое значение:
//  Строка - ○, ◐ или ●.
//
Функция СимволДоли(Числитель, Знаменатель)

	Если Знаменатель <= 0 Или Числитель <= 0 Тогда
		Символ = СимволНоль();
	ИначеЕсли Числитель >= Знаменатель Тогда
		Символ = СимволПолностью();
	Иначе
		Символ = СимволЧастично();
	КонецЕсли;
	Возврат Символ;

КонецФункции

Функция СимволНоль()

	Возврат "○";

КонецФункции

Функция СимволЧастично()

	Возврат "◐";

КонецФункции

Функция СимволПолностью()

	Возврат "●";

КонецФункции

Функция ЧислоИлиНоль(Значение)

	Возврат ?(ТипЗнч(Значение) = Тип("Число"), Значение, 0);

КонецФункции

#КонецОбласти
